In [2]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
db_warehouse = create_engine('postgresql://marcel:4UTebmZgDs7Hyfsq@warehouse:5432/warehouse')
db_replication = create_engine('postgresql://francois:4RzVZ2JmndK@db-slave2:5432/lottostar')

In [3]:
sql_query="""
select date(created_at) as win_date,
		sum(winnings) as win_value
from auth_userwinningslog 
                where created_at > now() - interval '30 days' and created_at < now() - interval '1 day'
        group by 1;
"""

In [4]:
df1 = pd.read_sql_query(sql_query, con=db_warehouse)
df2 = pd.read_sql_query(sql_query, con=db_replication)

In [5]:
df1.head()

     win_date  win_value
0  2018-05-06   331040.1
1  2018-06-03   242971.9
2  2018-05-16   516828.6
3  2018-05-08   338400.8
4  2018-05-27   511036.0

In [6]:
df2.head()

     win_date  win_value
0  2018-05-12   325666.2
1  2018-05-13   381512.2
2  2018-05-20   382311.4
3  2018-05-06   331040.1
4  2018-05-17   490115.9

In [7]:
df1['win_value'].sum() == df2['win_value'].sum()

False

In [8]:
df1['win_date'] = pd.to_datetime(df1['win_date'])

In [9]:
df2['win_date'] = pd.to_datetime(df2['win_date'])

In [10]:
last_day = df1['win_date'].max()

In [11]:
df1[(df1['win_date'] == last_day)]

    win_date  win_value
1 2018-06-03   242971.9

In [12]:
df2[(df2['win_date'] == last_day)]

    win_date  win_value
5 2018-06-03   242977.9

In [13]:
df2['win_value_diff'] = df1['win_value'] - df2['win_value']

In [14]:
df2[(df2['win_value_diff']!=0)].head()

    win_date  win_value  win_value_diff
0 2018-05-12   325666.2          5373.9
1 2018-05-13   381512.2       -138540.3
2 2018-05-20   382311.4        134517.2
3 2018-05-06   331040.1          7360.7
4 2018-05-17   490115.9         20920.1

test

In [15]:
result = pd.concat([df1, df2], axis=1, join='inner')

In [16]:
result.head()

    win_date  win_value   win_date  win_value  win_value_diff
0 2018-05-06   331040.1 2018-05-12   325666.2          5373.9
1 2018-06-03   242971.9 2018-05-13   381512.2       -138540.3
2 2018-05-16   516828.6 2018-05-20   382311.4        134517.2
3 2018-05-08   338400.8 2018-05-06   331040.1          7360.7
4 2018-05-27   511036.0 2018-05-17   490115.9         20920.1

 #A.merge(B, left_on='lkey', right_on='rkey', how='outer')
pd.merge(df1, df2, on='Customer_id', how='left')
http://www.datasciencemadesimple.com/join-merge-data-frames-pandas-python/

In [17]:
pd.merge(df1, df2, on='win_value', how='left').head()

  win_date_x  win_value win_date_y  win_value_diff
0 2018-05-06   331040.1 2018-05-06          7360.7
1 2018-06-03   242971.9        NaT             NaN
2 2018-05-16   516828.6 2018-05-16       -191162.4
3 2018-05-08   338400.8 2018-05-08         43910.6
4 2018-05-27   511036.0 2018-05-27       -292134.1

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False)   
         
https://pandas.pydata.org/pandas-docs/stable/merging.html

In [18]:
df4 = pd.merge(df1, df2, on='win_value', how='outer')

In [19]:
df1 = df1.sort_values(by=['win_date'])
df2 = df2.sort_values(by=['win_date'])

A.merge(B, left_on='lkey', right_on='rkey', how='outer')

In [20]:
df2.merge(df1, left_on='win_date',right_on='win_value', how='left').head()

            win_date_x  win_value_x  win_value_diff win_date_y  win_value_y
0  2018-05-05 00:00:00     218897.4        267191.4        NaN          NaN
1  2018-05-06 00:00:00     331040.1          7360.7        NaN          NaN
2  2018-05-07 00:00:00     370144.7        713849.4        NaN          NaN
3  2018-05-08 00:00:00     338400.8         43910.6        NaN          NaN
4  2018-05-09 00:00:00     328805.9         52706.3        NaN          NaN

In [21]:
df1

     win_date  win_value
20 2018-05-05   218901.9
0  2018-05-06   331040.1
28 2018-05-07   370144.7
3  2018-05-08   338400.8
13 2018-05-09   328805.9
9  2018-05-10   335803.8
8  2018-05-11   309946.4
15 2018-05-12   325666.2
23 2018-05-13   381512.2
12 2018-05-14   376545.8
21 2018-05-15   536973.8
2  2018-05-16   516828.6
24 2018-05-17   490115.9
22 2018-05-18   442616.0
14 2018-05-19   562924.3
16 2018-05-20   382311.4
25 2018-05-21   432355.0
11 2018-05-22   397427.3
17 2018-05-23   486088.8
5  2018-05-24   463470.4
7  2018-05-25   661287.6
29 2018-05-26   630546.7
4  2018-05-27   511036.0
19 2018-05-28   667610.4
18 2018-05-29   773843.3
26 2018-05-30  1083994.1
10 2018-05-31   968161.9
27 2018-06-01   697731.8
6  2018-06-02   778310.2
1  2018-06-03   242971.9

In [22]:
#df4 = pd.concat(df1, df2)
#pd.concat([s1, s2], keys=['s1', 's2'],

In [23]:
df4 = pd.concat([df1, df2], keys=['a','b'])

In [24]:
df4.loc['a']

     win_date  win_value  win_value_diff
20 2018-05-05   218901.9             NaN
0  2018-05-06   331040.1             NaN
28 2018-05-07   370144.7             NaN
3  2018-05-08   338400.8             NaN
13 2018-05-09   328805.9             NaN
9  2018-05-10   335803.8             NaN
8  2018-05-11   309946.4             NaN
15 2018-05-12   325666.2             NaN
23 2018-05-13   381512.2             NaN
12 2018-05-14   376545.8             NaN
21 2018-05-15   536973.8             NaN
2  2018-05-16   516828.6             NaN
24 2018-05-17   490115.9             NaN
22 2018-05-18   442616.0             NaN
14 2018-05-19   562924.3             NaN
16 2018-05-20   382311.4             NaN
25 2018-05-21   432355.0             NaN
11 2018-05-22   397427.3             NaN
17 2018-05-23   486088.8             NaN
5  2018-05-24   463470.4             NaN
7  2018-05-25   661287.6             NaN
29 2018-05-26   630546.7             NaN
4  2018-05-27   511036.0             NaN
19 2018-05-28   667610.4             NaN
18 2018-05-29   773843.3             NaN
26 2018-05-30  1083994.1             NaN
10 2018-05-31   968161.9             NaN
27 2018-06-01   697731.8             NaN
6  2018-06-02   778310.2             NaN
1  2018-06-03   242971.9             NaN

In [25]:
df4.loc['b']

     win_date  win_value  win_value_diff
17 2018-05-05   218897.4        267191.4
3  2018-05-06   331040.1          7360.7
26 2018-05-07   370144.7        713849.4
16 2018-05-08   338400.8         43910.6
23 2018-05-09   328805.9         52706.3
9  2018-05-10   335803.8             0.0
7  2018-05-11   309946.4        351341.2
0  2018-05-12   325666.2          5373.9
1  2018-05-13   381512.2       -138540.3
21 2018-05-14   376545.8        160428.0
18 2018-05-15   536973.8        236869.5
15 2018-05-16   516828.6       -191162.4
4  2018-05-17   490115.9         20920.1
19 2018-05-18   442616.0        224994.4
29 2018-05-19   562924.3         67622.4
2  2018-05-20   382311.4        134517.2
11 2018-05-21   432355.0        -34927.7
12 2018-05-22   397427.3        -20881.5
6  2018-05-23   486088.8        292221.4
22 2018-05-24   463470.4        -20854.4
28 2018-05-25   661287.6       -291142.9
27 2018-05-26   630546.7         67185.1
20 2018-05-27   511036.0       -292134.1
14 2018-05-28   667610.4       -104686.1
8  2018-05-29   773843.3       -463896.9
13 2018-05-30  1083994.1       -755188.2
10 2018-05-31   968161.9             0.0
25 2018-06-01   697731.8       -265376.8
24 2018-06-02   778310.2       -288194.3
5  2018-06-03   242977.9        220492.5